clc,clear
data = [900.2	554.2	4	4	7	5	16	66	85	5980
600	250	4	4	6	7	9.6	65	70	1699
270	100	4	4	9	9	24.62	50	70	5699
300	200	1	3	6	7	6.35	65	30	2299
846	622	4	4	8	5	16.5	67	80	6099
378	208	4	4	6	6	9.8	65	60	1599
655	437	4	4	6	7	8.8	68.6	67	2799
844	604	4	4	7	6	5.16	67	80	4999
800	400	4	4	6	8	14	69	90	2299
230	60	4	2	5	7	5.9	60	43	609


    ];%待评价指标
weight = [0.1185 0.1669	0.0821 0.068 0.0659	0.0671 0.1274 0.0598 0.0813	0.1632];%各指标的权重
data(:,[2,5]) = -data(:,[2,5]);%数据预处理，将成本型指标转换为效益性

ra = tiedrank(data)%编秩，即对每个指标各自进行排序
[row,col] = size(data);% 获取数据的维度信息
RSR = mean(ra, 2)/row;% 计算秩合比
W = repmat(weight, [row,1]);
WRSR = sum(ra.*W, 2)/row;%计算加权秩和比
[sWRSR, ind] = sort(WRSR);%对加权秩合比排序

p = [1:row] / row; %计算累计频率
p(end) = 1 - 1 / (4 * row) %修正最后一个累计频率，最后一个累计频率按1-1/（4n）估计
probit = norminv(p,0,1) + 5 % 计算标准正太分布的p分位数+5


x = [ones(row,1),probit'];% 构造一元线性回归分析的数据矩阵
[ab, abint, r, rint, stats] = regress(sWRSR,x)
WRSRfit = ab(1) + ab(2) * probit; % 计算WRSR的估计值
WRSRfit'
y = [1:13];
y(ind)'